---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPosition.GetSizeInFloats
source: html/8d776a22-2aa5-86c8-e747-488c818acb29.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPosition.GetSizeInFloats Method

Gets the amount of storage that the vertex takes up in a buffer, measured in floats.

## Syntax (C#)
```csharp
public static int GetSizeInFloats()
```

## Returns
The number of floats occupied by one vertex of this type.